Revit 2027 API
ConceptualConstructionWindowSkylightType Enumeration
 ConceptualConstructionType values for Windows and Skylights
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum ConceptualConstructionWindowSkylightType
Public Enumeration ConceptualConstructionWindowSkylightType
public enum class ConceptualConstructionWindowSkylightType
type ConceptualConstructionWindowSkylightType
Members
Member name | Value | Description
DoublePaneClearHighestPerformanceLowEHighVisTransLowSHGC | 8 |  Double Pane Clear Highest Performance Low Window or Skylight
DoublePaneClearLowEColdClimateHighSHGC | 6 |  Double Pane Clear Low Energy Cold Climate High Solar Heat Gain Coefficient Window or Skylight
DoublePaneClearLowEHotClimateLowSHGC | 7 |  Double Pane Clear Low Energy Hot Climate Low Solar Heat Gain Coefficient Window or Skylight
DoublePaneClearNoCoating | 3 |  Double Pane Clear No Coating Window or Skylight
DoublePaneReflective | 5 |  Double Pane Reflective Window or Skylight
DoublePaneTinted | 4 |  Double Pane Tinted Window or Skylight
InvalidWindowSkylightTypeConstruction | -1 |  Invalid value/not set Window or Skylight Type Construction
NumWindowSkylightTypeConstruction | 11 |  Total Number of Window or Skylight Type Constructions
QuadPaneClearLowEHotOrColdClimate | 10 |  Quad Pane Clear Low Energy Hot Or Cold Climate Window or Skylight
SinglePaneClearNoCoating | 0 |  Single Pane Clear No Coating Window or Skylight
SinglePaneReflective | 2 |  Single Pane Reflective Window or Skylight
SinglePaneTinted | 1 |  Single Pane Tinted Window or Skylight
TriplePaneClearLowEHotOrColdClimate | 9 |  Triple Pane Clear Low Energy Hot or Cold Climate Window or Skylight
See Also
Reference
Autodesk.Revit.DB.Analysis Namespace